In [27]:
# 7-1-1 누락된 데이터 (= 결측값) 골라내기
import pandas as pd
import numpy as np
string_Data = pd.Series(["a","b","c",np.nan,"d"])
string_Data # 1차원에 시리즈로 데이터가 출력됨을 볼수 있고 3행에 해당하는 데이터를 NA값을 가졌음도 확인

0      a
1      b
2      c
3    NaN
4      d
dtype: object

In [6]:
string_Data.isnull() # NA값 존재 여부를 존재하면 True 없으면 False로 해석가능

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [7]:
#.dropna() Series에 적용하면 NA가 아닌 데이터와 색인값만 들어있는 Series를 출력한다.

In [10]:
from numpy import nan as NA # numpy 라이브러리에서 nan 메서드를 가져오는데 줄여서 NA로 할게 
data = pd.DataFrame([ [1,6.5,3] , [1, NA, NA] , [NA,NA,NA] , [NA,6.5,3]])
data # 4행 3열의 데이터프레임을 볼 수 있음

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data.dropna() # NA가 하나라도 포함되어 있으면 무조건 제외시키기 때문에 "0행"만 추출함을 볼 수 있음

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how="all") # 모두 NA인 행만 제외시킨다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data.dropna(how="all", axis = 1) # axis = 1을 주면 기존에 row 였던 기준이 columns로 바뀌면서
                                 # column 내에 모두 NA값이 아닌 녀석들이기 없기 때문에 데이터 변화 없이 모두 추출됬음을 볼 수 있다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
# dropna(thresh=2) 2개 이상의 na면 제거한다 (thresh=1은 적용이 안되는 것 같음)
data.dropna(thresh = 2)

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

In [33]:
# 7-1-2 결측치 채우기 .fillna(n) na값을 n으로 채워 넣음.
data.fillna(0)

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

In [36]:
data.fillna({0:2, 1:0.5, 2:0}) # 딕셔너리를 줘서 각 columns에 다른 값을 부여할 수 있음.

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.5  0.0
2  2.0  0.5  0.0
3  2.0  6.5  3.0

In [39]:
data #fillna(n)은 원본 데이터 수정이 아닌 복사본을 만드는 행위임.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [43]:
data.fillna({0:2, 1:0.5, 2:0}, inplace = True) #fillna(n, inplace = True)는 원본 데이터 자체 내용을 바꾸는 행위임.
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.5  0.0
2  2.0  0.5  0.0
3  2.0  6.5  3.0

In [46]:
data = pd.DataFrame([ [1,6.5,3] , [1, NA, NA] , [NA,NA,NA] , [NA,6.5,3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [52]:
data.fillna(method = 'ffill') # method = 'ffill 은 "상위 행데이터" 값으로 바꿔준다.
data.fillna(axis = 1, method = 'ffill') #  axis = 1 "좌측 열 데이터" 값으로 바꿔준다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  1.0  1.0
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [54]:
data.fillna(data.mean()) # na 값을 채우기 용으로는 대체적으로 중간값, 평균값을 많이 이용한다.
                         # 다수의 데이터를 충분히 반영할 수 있다는 장점을 가진 동시에 소수의 데이터는 반영하지 못하는 단점을 갖고 있다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.5  3.0

In [58]:
#7-2-1 중복제거하기(데이터를 취합하는 과정에서 중복이 생기기 마련임)
dic_data = {"k1":['one','two','one','two','one','two','two'],
           "k2":[1,1,2,3,3,4,4]}
dic_data # 딕셔너리 출력

{'k1': ['one', 'two', 'one', 'two', 'one', 'two', 'two'],
 'k2': [1, 1, 2, 3, 3, 4, 4]}

In [63]:
data = pd.DataFrame(dic_data)
data # 데이터 프레임화

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [65]:
# .duplicated row가 중복인지 아닌지 알려줌
data.duplicated() #5,6번이 중복임을 확인 가능

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [69]:
#.drop_duplicates() 중복된 row를 날림
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [71]:
data['v1'] = [0,1,2,3,4,5,6] # v1 을 추가하면서 데이터가 다르면서 이전에 k1,2의 중복값이라고 인식을 못함.
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [73]:
data.drop_duplicates(['k1']) # k1 을 기준으로 중복 체크를 해볼게 
# k1 col 자체에는 아예 one, two 밖에 없기 때문에 상위 one two를 제외한 나머지 값들은 제외 되었음을 볼 수 있음

    k1  k2  v1
0  one   1   0
1  two   1   1

In [75]:
data.drop_duplicates(["k1","k2"], keep = "last") # k1,k2를 기준으로 두고 중복을 비교할게 
                                                 # 대신 중복되었을때 남겨두는 건 마지막 데이터를 기준으로 한다

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [81]:
#7-2-2 함수나 매핑을 이용해서 데이터 변형하기
dic_food = {'food':['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
        'ounces': [4,3,12,6,7.5,8,3,5,6]}
dic_food

{'food': ['bacon',
  'pulled pork',
  'bacon',
  'Pastrami',
  'corned beef',
  'Bacon',
  'pastrami',
  'honey ham',
  'nova lox'],
 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]}

In [90]:
data = pd.DataFrame(dic_food) # 딕셔너리 데이터 프레임화
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [87]:
# 새로 추가할 칼럼 만들기
meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork' : 'pig',
    'pastrami' : 'cow',
    'corned beef' : 'cow',
    'honey ham' : 'pig',
    'nova lox' : 'salmon'
}

In [92]:
# map 사전류의 객체나 어떤 함수를 받을 수 있음.
# 이름에 대소문자가 섞여 있는 사소한 문제가 있으므로 모두 소문자로 바꾸자
lowercased = data['food'].str.lower() # 데이터에 food 칼럼을 문자 소문자화 시킬거야     
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object